In [2]:
import pandas as pd

In [3]:
titanic_survival = pd.read_csv('./titanic_survival.csv')

In [4]:
titanic_survival.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [5]:
passenger_classes = [1, 2, 3]
fares_by_class = {}

In [6]:
for i in passenger_classes:
    select = titanic_survival['pclass'] == i
    hold = titanic_survival['fare'][select]
    fares_by_class[i] = hold.mean()
fares_by_class

{1: 87.50899164086687, 2: 21.1791963898917, 3: 13.302888700564957}

In [7]:
ting = titanic_survival['pclass'] == 1
poh = titanic_survival['fare'][ting]
poh.mean()

87.50899164086687

In [8]:
import numpy
passenger_survival = titanic_survival.pivot_table(index="pclass", values="survived")
passenger_age = titanic_survival.pivot_table(index='pclass', values='age', aggfunc = numpy.mean)

In [9]:
passenger_survival

        survived
pclass
1.0     0.619195
2.0     0.429603
3.0     0.255289

In [10]:
passenger_age

              age
pclass
1.0     39.159918
2.0     29.506705
3.0     24.816367

In [11]:
def hundredth_row(column):
    hundredth_item = column.iloc[99]
    return hundredth_item

hundredth_row_var = titanic_survival.apply(hundredth_row)
hundredth_row_var

pclass                                                       1
survived                                                     1
name         Duff Gordon, Lady. (Lucille Christiana Sutherl...
sex                                                     female
age                                                         48
sibsp                                                        1
parch                                                        0
ticket                                                   11755
fare                                                      39.6
cabin                                                      A16
embarked                                                     C
boat                                                         1
body                                                       NaN
home.dest                                       London / Paris
dtype: object

In [12]:
def wombat(col):
    bool_list = pd.isnull(col)
    ting = col[bool_list]
    return len(ting)
pinger = titanic_survival.apply(wombat)
pinger

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64